[
    {
        "title": "NASA's MAVEN Witnesses Martian Lightshow",
        "preview": "MAVEN observed a dazzling display of ultraviolet aurorae, the first of its kind in eight years."
    },
    {
        "title": "Farewell to InSight: A Martian Mission Ends",
        "preview": "NASA prepares to say goodbye to its InSight lander as its power dwindles."
    },
    {
        "title": "NASA and ESA Team Up for Mars Sample Return",
        "preview": "Perseverance rover will collect samples for a future mission to bring back to Earth."
    },
    {
        "title": "InSight Feels the Impact of a Martian Meteorite",
        "preview": "NASA's lander detected a powerful impact and captured the resulting crater."
    },
    {
        "title": "NASA to Reveal New Mars Findings",
        "preview": "Scientists from InSight and Mars Reconnaissance Orbiter will share a major discovery."
    },
    {
        "title": "NASA's SHIELD Mission: A Controlled Crash on Mars",
        "preview": "An experimental lander designed to survive a hard landing on the Red Planet."
    },
    {
        "title": "Curiosity Reaches a Salty Region on Mars",
        "preview": "The rover has arrived at a region believed to hold clues about Mars' past."
    },
    {
        "title": "Protecting Mars Sample Return Mission from Micrometeorites",
        "preview": "NASA is developing shields to protect spacecraft from tiny space rocks."
    },
    {
        "title": "InSight Braces for a Martian Dust Storm",
        "preview": "NASA's team is taking steps to keep the solar-powered lander operational."
    },
    {
        "title": "InSight 'Hears' Meteorite Impacts on Mars",
        "preview": "The lander's seismometer has detected vibrations from four separate impacts."
    },
    {
        "title": "Perseverance Discovers Watery Past in Mars' Jezero Crater",
        "preview": "The rover's findings suggest that the crater once had a river delta."
    },
    {
        "title": "NASA to Discuss Perseverance's Martian Adventures",
        "preview": "Mission members will talk about the rover's activities and sample collection."
    },
    {
        "title": "Perseverance Finds Volcanic Rocks in Jezero Crater",
        "preview": "The rover has discovered evidence of volcanic activity that interacted with water."
    },
    {
        "title": "Curiosity Celebrates 10 Years on Mars",
        "preview": "The rover is preparing for a new phase of its mission as it climbs a Martian mountain."
    },
    {
        "title": "SAM's Top 5 Discoveries on Curiosity",
        "preview": "A look back at the instrument's most significant findings on Mars."
    }
]
